# Capstone 3 
## Data Wrangling

First we import

In [2]:
import pandas as pd
import numpy as np

Load Dataset

In [3]:
downloaded_dataset='../data/external/Online Retail.xlsx'
df=pd.read_excel(downloaded_dataset)

Examine the data

In [4]:
df.sample(7)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
384179,570108,22818,CARD CHRISTMAS VILLAGE,12,2011-10-07 12:25:00,0.42,13004.0,United Kingdom
348387,567426,22423,REGENCY CAKESTAND 3 TIER,4,2011-09-20 11:33:00,12.75,13767.0,United Kingdom
73722,542374,21586,KINGS CHOICE GIANT TUBE MATCHES,12,2011-01-27 13:40:00,2.55,15696.0,United Kingdom
424042,C573180,23048,SET OF 10 LANTERNS FAIRY LIGHT STAR,-1,2011-10-28 11:00:00,4.15,NaN,United Kingdom
10466,537237,22212,FOUR HOOK WHITE LOVEBIRDS,3,2010-12-06 09:58:00,4.21,NaN,United Kingdom
500594,578790,23320,GIANT 50'S CHRISTMAS CRACKER,2,2011-11-25 12:20:00,2.89,14966.0,United Kingdom
244091,558475,22955,36 FOIL STAR CAKE CASES,7,2011-06-29 15:58:00,2.46,NaN,United Kingdom

I like to use sample instead of head() to give me a random sample

In [5]:
df.shape

(541909, 8)

Not too many features but lots of values

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

The types look ok at the moment, it is strange that CustomerID is a float instead of an object

In [52]:
df["CustomerID"] = df["CustomerID"].astype(int)

Let's look for duplicates

In [53]:
df.duplicated().sum()

0

In [54]:
df = df[~df.duplicated()]
df.shape

(524878, 8)

Let's look for missing values

In [55]:
df.isnull().sum()*100/len(df)

InvoiceNo      0.0
StockCode      0.0
Description    0.0
Quantity       0.0
InvoiceDate    0.0
UnitPrice      0.0
CustomerID     0.0
Country        0.0
dtype: float64

Looks like we are missing 25% of the CustomerID

In [56]:
df['CustomerID'].fillna(00000, inplace=True)

In [57]:
df.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [58]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  524878.000000  524878.000000  524878.000000
mean       10.616600       3.922573   11437.732164
std       156.280031      36.093028    6799.513627
min         1.000000       0.001000       0.000000
25%         1.000000       1.250000       0.000000
50%         4.000000       2.080000   14350.000000
75%        11.000000       4.130000   16245.000000
max     80995.000000   13541.330000   18287.000000

negative minimum? why are there negative quantities and prices? maybe returns?

In [59]:
df=df[df['Quantity']>0]

In [60]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  524878.000000  524878.000000  524878.000000
mean       10.616600       3.922573   11437.732164
std       156.280031      36.093028    6799.513627
min         1.000000       0.001000       0.000000
25%         1.000000       1.250000       0.000000
50%         4.000000       2.080000   14350.000000
75%        11.000000       4.130000   16245.000000
max     80995.000000   13541.330000   18287.000000

In [15]:
df=df[df['UnitPrice']>0]

In [16]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  524878.000000  524878.000000  524878.000000
mean       10.616600       3.922573   11437.732164
std       156.280031      36.093028    6799.513627
min         1.000000       0.001000       0.000000
25%         1.000000       1.250000       0.000000
50%         4.000000       2.080000   14350.000000
75%        11.000000       4.130000   16245.000000
max     80995.000000   13541.330000   18287.000000

Excellent, now we have a cleaned up dataset without missing values and no negative numbers. 
Let's now export it to work on further.

In [61]:
df.to_csv('../data/clean/Online Retail.csv',index=False)